---
kind: method
id: M:Autodesk.Revit.DB.VertexIndexPairArray.Insert(Autodesk.Revit.DB.VertexIndexPair,System.Int32)
source: html/f3888c44-ed9b-497f-0b80-a801b863da6d.htm
---
# Autodesk.Revit.DB.VertexIndexPairArray.Insert Method

## Syntax (C#)
```csharp
public virtual void Insert(
	VertexIndexPair item,
	int index
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.VertexIndexPair`)
- **index** (`System.Int32`)